index="brute-force-logs" sourcetype="csv"
| rex field=message "(?<result>Failed password|Accepted password)"
| stats earliest(_time) AS first_fail latest(eval (if (result=="Accepted password", _time, null))) AS first_success count(eval(result="Failed password")) AS fail_count by src_ip, user
| where fail_count >= 5 AND isnotnull(first_success) AND first_success > first_fail
| convert timeformat="%F %T" ctime(first_fail) AS first_fail_time
| convert timeformat="%F %T" ctime(first_success) AS first_success_time
| table src_ip, user, fail_count, first_fail_time, first_success_time
